app/controllers/users_controller.rb

  def create
    @user = User.new(params[:user])
    begin
      if @user.save!
---
INSERT INTO `users` (`salt`, `updated_at`, `hashed_password`, `remember_token_expires_at`, `is_admin`, `remember_token`, `first_name`, `last_name`, `email`, `created_at`) VALUES('382648700.423667834972816', '2009-07-23 09:37:16', 'fbcd91199f829c8efb4bfe7d6ebec7673b66e105', NULL, 0, NULL, 'yi', 'zheng', NULL, '2009-07-23 09:37:16')